posts/2025-05-03-christian-right-religious-right.org
#+TITLE: Christian Right or Religious Right?
#+date: <2025-05-03 Sat 04:39>
#+filetags:  quotes religion politics
#+setupfile: ../org-templates/post.org

#+ATTR_HTML: :class bigquote
#+begin_quote
The Christian right is dead, but the religious right is stronger than it’s ever been. Another way of putting it is that the religious right has divorced itself from historical Christian theology but still holds its partisan beliefs with religious intensity. The religious fervor is there. Christian virtues are not.
#+end_quote

#+ATTR_HTML: :class bigquote
[[https://www.nytimes.com/2025/05/01/opinion/trump-evangelicals-republicans.html][David French]]


#+begin_tagline
Tagged:  [[file:../tags/quotes.org][Quotes]] [[file:../tags/religion.org][Religion]] [[file:../tags/politics.org][Politics]]
#+end_tagline
