docs/posts/2025-05-03-christian-right-religious-right.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- May 03, 2025 04:41 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Christian Right or Religious Right?</title>
<meta name="author" content="Randy Ridenour" />
<meta name="generator" content="Org Mode" />
<link rel='icon' type='image/x-icon' href='/images/favicon.ico'/>
<meta name='viewport' content='width=device-width, initial-scale=1'>
<link rel='stylesheet' href='/css/normalize.css' type='text/css'/>
<link rel='stylesheet' href='/css/main.css' type='text/css'/>
</head>
<body>
<header id="top" class="status">
<div class="banner">
  <h2><a href="/">Randy Ridenour</a></h2>
  <nav class="navbar">
    <ul>
      <li><a href="/">Home</a></li>
      <li><a href="/posts/">Blog</a></li>
      <li><a href="/about.html">About</a></li>
      <li><a href="/tags/">Tags</a></li>
      <li><a href="/atom.xml">Feed</a></li>
    </ul>
  </nav>
</div>
</header>
<main id="content" class="content">
<h1 class="title">Christian Right or Religious Right?
<br />
<span class="subtitle">May 03, 2025 04:39</span>
</h1>
<blockquote class="bigquote">
<p>
The Christian right is dead, but the religious right is stronger than it’s ever been. Another way of putting it is that the religious right has divorced itself from historical Christian theology but still holds its partisan beliefs with religious intensity. The religious fervor is there. Christian virtues are not.
</p>
</blockquote>

<p class="bigquote">
<a href="https://www.nytimes.com/2025/05/01/opinion/trump-evangelicals-republicans.html" class="bigquote">David French</a>
</p>


<div class="tagline" id="org20e64a1">
<p>
Tagged:  <a href="../tags/quotes.html">Quotes</a> <a href="../tags/religion.html">Religion</a> <a href="../tags/politics.html">Politics</a>
</p>

</div>
</main>
<footer id="postamble" class="status">
<div class='footer'>
  Copyright © 2024 <a href='mailto:rlridenour@fastmail.com'>Randy Ridenour.</a><br>
  Last updated on May 03, 2025 04:41.<br>
  Generated using <a href="https://www.gnu.org/software/emacs/">Emacs</a> 30.1 (<a href="https://orgmode.org">Org</a> mode 9.8-pre).
</div>
</footer>
</body>
</html>
